app/Controllers/Auth.php

    public function login()
    {
        if (session()->get('isLoggedIn')) {
            if (!session()->get('storeType')) {
                return redirect()->to('/store/select');
            }
            return redirect()->to('/stock/inventory');
        }

        $data = [
            'title' => 'Login'
        ];

        if (strtolower($this->request->getMethod()) === 'post') {
            $username = trim((string) $this->request->getPost('username'));
            $password = (string) $this->request->getPost('password');

            $user = $this->userModel->where('username', $username)->first();
---
SELECT *
FROM `users`
WHERE `username` = 'admin'
 LIMIT 1