app/Controllers/Customer.php

    public function create()
    {
        if ($redirect = $this->requireLogin()) {
            return $redirect;
        }

        $data = [
            'title' => 'Add Customer Record',
            'products' => $this->productModel->orderBy('product_name', 'ASC')->findAll(),
            'categories' => $this->productModel->select('category')->distinct()->findAll(),
---
SELECT *
FROM `products`
ORDER BY `product_name` ASC
SELECT DISTINCT `category`
FROM `products`

    'notes' => trim((string) $this->request->getPost('notes')),
];

        if ($this->customerModel->insert($customerData)) {
---
INSERT INTO `customers` (`customer_name`, `product_bought`, `product_category`, `quantity`, `price`, `purchase_date`, `notes`, `created_at`, `updated_at`) VALUES ('Jane', 'Fiesta', 'LPG', 1, 1588, '2026-05-13 00:35:00', '', '2026-05-13 00:36:01', '2026-05-13 00:36:01')