app/Controllers/Dashboard.php

SELECT SUM(`total_amount`) AS `total_amount`
FROM `sales`
---
    public function index()
    {
        if ($redirect = $this->requireLogin()) {
            return $redirect;
        }

        // Get date range from request
        $preset = trim((string) $this->request->getGet('preset'));
        $dateFrom = trim((string) $this->request->getGet('date_from'));
        $dateTo = trim((string) $this->request->getGet('date_to'));

        // Initialize variables to prevent undefined errors
        $preset = $preset ?: '';
        $dateFrom = $dateFrom ?: '';
        $dateTo = $dateTo ?: '';

        // Apply preset dates if selected
        $this->applyPresetDates($preset, $dateFrom, $dateTo);

        // Build query for income calculation
        $incomeQuery = $this->salesModel;
        if ($dateFrom !== '') {
            $incomeQuery->where('DATE(sale_date) >=', $dateFrom);
        }
        if ($dateTo !== '') {
            $incomeQuery->where('DATE(sale_date) <=', $dateTo);
        }

        $incomeData = $incomeQuery
            ->selectSum('total_amount')
            ->get()
            ->getRow();

SELECT `category`, COUNT(*) as count, SUM(quantity) as total_qty
FROM `products`
GROUP BY `category`
SELECT `id`, `product_name`, `product_code`, `buying_price`, `selling_price`
FROM `products`
ORDER BY `product_name` ASC
SELECT `category`, COUNT(*) as products_count, AVG(buying_price) as avg_buying_price, AVG(selling_price) as avg_selling_price
FROM `products`
GROUP BY `category`
---
        $totalIncome = (float) ($incomeData->total_amount ?? 0);

        // Get inventory summary by category
        $inventorySummary = $this->productModel
            ->select('category, COUNT(*) as count, SUM(quantity) as total_qty')
            ->groupBy('category')
            ->get()
            ->getResult();

        $productPricing = $this->productModel
            ->select('id, product_name, product_code, buying_price, selling_price')
            ->orderBy('product_name', 'ASC')
            ->findAll();

        $categoryPricing = $this->productModel
            ->select('category, COUNT(*) as products_count, AVG(buying_price) as avg_buying_price, AVG(selling_price) as avg_selling_price')
            ->groupBy('category')
            ->get()
            ->getResult();