app/Controllers/Inventory.php

SELECT *
FROM `fixed_prices`
---
    private function getFixedPriceMap(): array
    {
        $map = [];
        foreach ($this->fixedPriceModel->findAll() as $row) {

SELECT COUNT(*) AS `numrows` FROM `products`
---
    public function index()
    {
        if ($redirect = $this->requireLogin()) {
            return $redirect;
        }

        $products = $this->productModel->getAllProducts();
        foreach ($products as $product) {
            $this->ensureFixedPriceForProduct($product);
        }

        $data = [
            'title' => 'Dashboard',
            'products' => $products,
            'totalProducts' => $this->productModel->countAll(),

SELECT *
FROM `products`
ORDER BY `product_name` ASC
---
    public function fixedPrices()
    {
        if ($redirect = $this->requireLogin()) {
            return $redirect;
        }

        $products = $this->productModel->orderBy('product_name', 'ASC')->findAll();

UPDATE `fixed_prices` SET `buying_price` = 1340, `selling_price` = 1588
WHERE `fixed_prices`.`id` IN ('5')
---

                $existing = $this->fixedPriceModel->getByProductId($productId);
                if ($existing) {
                    $this->fixedPriceModel->update($existing->id, [
                        'buying_price' => $buying,
                        'selling_price' => $selling,
                    ]);

UPDATE `products` SET `buying_price` = 1340, `selling_price` = 1588, `updated_at` = '2026-05-13 00:35:46'
WHERE `products`.`id` IN (10)
---
                    ]);
                }

                $this->productModel->update($productId, [
                    'buying_price' => $buying,
                    'selling_price' => $selling,
                ]);