app/Controllers/Inventory.php

SELECT COUNT(*) AS `numrows` FROM `products`
---
    public function index()
    {
        if ($redirect = $this->requireLogin()) {
            return $redirect;
        }

        $data = [
            'title' => 'Dashboard',
            'products' => $this->productModel->getAllProducts(),
            'totalProducts' => $this->productModel->countAll(),
            'lowStock' => $this->productModel->getLowStock(10)
        ];

INSERT INTO `products` (`product_code`, `product_name`, `category`, `unit`, `description`, `quantity`, `supplier`, `buying_price`, `selling_price`, `created_at`, `updated_at`) VALUES ('qegfg', 'qfqfq', '', 'kg', 'qwfqfqw', '013', '123', '123132', '131', '2026-04-16 23:49:28', '2026-04-16 23:49:28')
---
    public function add()
    {
        if ($redirect = $this->requireLogin()) {
            return $redirect;
        }

        $data = [
            'title' => 'Add New Product',
            'categories' => $this->categoryModel->getAllCategories()
        ];

        if ($this->request->getMethod() === 'POST') {
            $postData = $this->request->getPost();

            if ($this->productModel->insert($postData)) {

SELECT *
FROM `products`
WHERE `products`.`id` = '2'
UPDATE `products` SET `product_code` = 'd124fu128g', `product_name` = 'gatorade', `category` = '', `unit` = 'box', `description` = 'Delivery', `quantity` = '2', `supplier` = 'May Ann', `buying_price` = '2.99', `selling_price` = '9.99', `updated_at` = '2026-04-16 23:49:12'
WHERE `products`.`id` IN ('2')
---
    public function edit($id = null)
    {
        if ($redirect = $this->requireLogin()) {
            return $redirect;
        }

        $product = $this->productModel->find($id);

        if (!$product) {
            return redirect()->to('/inventory')->with('error', 'Product not found!');
        }

        $data = [
            'title' => 'Edit Product',
            'product' => $product,
            'categories' => $this->categoryModel->getAllCategories()
        ];

        if ($this->request->getMethod() === 'POST') {
            $postData = $this->request->getPost();
            $postData['id'] = $id;

            if ($this->productModel->update($id, $postData)) {

SELECT *
FROM `products`
WHERE `products`.`id` = '3'
DELETE FROM `products`
WHERE `id` IN ('3')
---
    public function delete($id = null)
    {
        if ($redirect = $this->requireLogin()) {
            return $redirect;
        }

        $product = $this->productModel->find($id);

        if (!$product) {
            return redirect()->to('/inventory')->with('error', 'Product not found!');
        }

        $this->productModel->delete($id);