app/Controllers/Sales.php

    public function index()
    {
        if ($redirect = $this->requireLogin()) {
            return $redirect;
        }

        $dateFrom = trim((string) $this->request->getGet('date_from'));
        $dateTo = trim((string) $this->request->getGet('date_to'));
        $preset = trim((string) $this->request->getGet('preset'));
        $this->applyPresetDates($preset, $dateFrom, $dateTo);

        $builder = $this->salesModel->orderBy('id', 'DESC');
        if ($dateFrom !== '') {
            $builder->where('DATE(sale_date) >=', $dateFrom);
        }
        if ($dateTo !== '') {
            $builder->where('DATE(sale_date) <=', $dateTo);
        }

        $sumBuilder = \Config\Database::connect()->table('sales');
        if ($dateFrom !== '') {
            $sumBuilder->where('DATE(sale_date) >=', $dateFrom);
        }
        if ($dateTo !== '') {
            $sumBuilder->where('DATE(sale_date) <=', $dateTo);
        }
        $sumRow = $sumBuilder->selectSum('total_amount')->get()->getRow();
---
SELECT COALESCE(NULLIF(customer_name, ''), 'Walk-in Customer') as customer_name, COUNT(*) as total_transactions, SUM(total_amount) as total_amount
FROM `sales`
GROUP BY COALESCE(NULLIF(customer_name, ''), 'Walk-in Customer')
ORDER BY `total_amount` DESC
SELECT SUM(`total_amount`) AS `total_amount`
FROM `sales`


        $data = [
            'title' => 'Sales Records',
            'sales' => $builder->findAll(),
---
SELECT *
FROM `sales`
ORDER BY `id` DESC