app/Models/CustomerModel.php

    public function getAllCustomers()
    {
        return $this->orderBy('purchase_date', 'DESC')->findAll();
---
SELECT *
FROM `customers`
ORDER BY `purchase_date` DESC

    public function getCustomerSummary()
    {
        return $this->select('MIN(id) as id, customer_name, COUNT(*) as total_purchases, SUM(quantity) as total_quantity, SUM(price * quantity) as total_spent')
                    ->groupBy('customer_name')
                    ->orderBy('total_spent', 'DESC')
                    ->findAll();
---
SELECT MIN(id) as id, `customer_name`, COUNT(*) as total_purchases, SUM(quantity) as total_quantity, SUM(price * quantity) as total_spent
FROM `customers`
GROUP BY `customer_name`
ORDER BY `total_spent` DESC

    public function getCategorySummary()
    {
        return $this->select('product_category, COUNT(*) as total_sales, SUM(quantity) as total_quantity, SUM(price * quantity) as total_revenue')
                    ->groupBy('product_category')
                    ->orderBy('total_revenue', 'DESC')
                    ->findAll();
---
SELECT `product_category`, COUNT(*) as total_sales, SUM(quantity) as total_quantity, SUM(price * quantity) as total_revenue
FROM `customers`
GROUP BY `product_category`
ORDER BY `total_revenue` DESC