app/Models/FixedPriceModel.php

SELECT `fixed_prices`.*, `products`.`product_name`, `products`.`product_code`, `products`.`category`, `products`.`cylinder_weight`
FROM `fixed_prices`
INNER JOIN `products` ON `products`.`id` = `fixed_prices`.`product_id`
ORDER BY `products`.`product_name` ASC
---
    public function getAllWithProduct(): array
    {
        return $this->select('fixed_prices.*, products.product_name, products.product_code, products.category, products.cylinder_weight')
            ->join('products', 'products.id = fixed_prices.product_id', 'inner')
            ->orderBy('products.product_name', 'ASC')
            ->findAll();

SELECT *
FROM `fixed_prices`
WHERE `product_id` = 10
 LIMIT 1
---
    public function getByProductId(int $productId): ?object
    {
        $row = $this->where('product_id', $productId)->first();