app/Models/ProductModel.php

    public function getAllProducts()
    {
        return $this->orderBy('created_at', 'DESC')->findAll();
---
SELECT *
FROM `products`
ORDER BY `created_at` DESC

    public function getLowStock($threshold = 10)
    {
        return $this->where('quantity <', $threshold)->findAll();
---
SELECT *
FROM `products`
WHERE `quantity` < 10